app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "2000-05-25 00:00:00.000000"], ["updated_at", "2015-11-30 16:17:57.821835"], ["id", 1]]